// Άσκηση 1
#include <stdio.h>

void printRow(int row) {
    // Εκτύπωσε τη row-οστή γραμμή
    for (int col = 0; col < 10; col++) printf("%d\t", 10 * col + row);
    // κάθε στήλη χωρίζεται από έναν στηλοθέτη

    return;
}
/* Οι αριθμοί εκτυπώνονται ανά στήλες, δηλαδή η 1η γραμμή περιέχει αριθμούς που
τελειώνουν σε 1, η 2η γραμμή περιέχει αριθμούς που τελειώνουν σε 2 κ.ο.κ. */
int main() {
    // για 10 γραμμές
    for (int row = 1; row <= 10; row += 1) {
        // εκτύπωσε τη γραμμή με τους αριθμούς που τελειώνουν σε row
        printRow(row);
        printf("\n");  // πήγαινε στην επόμενη γραμμή
    }
    return 0;
}
