#include <stdio.h>

// Άσκηση 2

int main() {
    int h, min, sec;

    do {
        printf("Give time in hh:mm:ss format: ");
        scanf("%d:%d:%d", &h, &min, &sec);

        // επικυροποίηση εισαγόμενων τιμών
        // μέγιστη ώρα: 23:59:59, δεν επιτρέπονται αρνητικές ώρες
    } while ((h > 24 || min > 60 || sec > 60) || (h < 0 || min < 0 || sec < 0));

    /* Για να υπολογίσουμε πόση ώρα απομένει μέχρι τα μεσάνυχτα,
    πρέπει να κάνουμε 24h - [δοσμένη ώρα]. */

    /* Ο ευκολότερος τρόπος να γίνει αυτό είναι να μετατρέψουμε
    την δοσμένη ώρα σε δευτερόλεπτα από την αρχή της ημέρας
    και να τα αφαιρέσουμε από τα δευτερόλεπτα μίας ημέρας,
    δηλαδή από 24 * 60 * 60. */

    // υπολογισμός δευτερολέπτων από την αρχή της ημέρας
    int secFromMidnight;
    secFromMidnight = h * 60 * 60 + min * 60 + sec;

    // υπολογισμός δευτερολέπτων μέχρι τα μεσάνυχτα
    int sec2Midnight;

    // [υπολειπόμενη ώρα] = 24h - [δοσμένη ώρα]
    sec2Midnight = 24 * 60 * 60 - secFromMidnight;

    h = sec2Midnight / (60 * 60);  // υπολογισμός ωρών
    sec2Midnight %= (60 * 60);

    min = sec2Midnight / 60;  // υπολογισμός λεπτών
    sec2Midnight %= 60;

    // τα υπόλοιπα δευτερόλεπτα είναι λιγότερο από ένα λεπτό,
    // άρα είναι και η ένδειξη των δευτερολέπτων
    sec = sec2Midnight;

    printf("%02d:%02d:%02d until midnight.\n", h, min, sec);
    // εκτύπωση πάντα με 2 ψηφία

    return 0;
}
