#include <stdio.h>

// Άσκηση 4

int main() {
    int number;       // ο δοσμένος αριθμός
    int flipped = 0;  // ο αντιστραμμένος αριθμός

    do {
        printf("Give a 5-digit number: ");
        scanf("%d", &number);
    } while (number < 10000 || number >= 100000);
    // ο αριθμός πρέπει να είναι πενταψήφιος,
    // δηλαδή μεταξύ 10000 και 99999

    // Έστω ο αριθμός number = xyzwv
    for (int i = 0; i < 5; i++) {  // για κάθε ένα από τα 5 ψηφία

        flipped *= 10;  // δεκαδική ολίσθηση προς τα αριστερά,
                        // ώστε ο αριθμός να τελειώνει σε 0: vw -> vw0

        flipped += number % 10;  // πρόσθεση του τελευταίου ψηφίου: vw0 -> vwz

        number /= 10;  // δεκαδική ολίσθηση προς τα δεξιά,
                       // ώστε να πάρουμε το επόμενο ψηφίο: xyz -> xy
    }
    // εκτύπωση του αντιστραμμένου αριθμού με 5 ψηφία,
    // για πενταψήφιους που λήγουν σε 0
    printf("The reversed number is %05d\n", flipped);

    return 0;
}
