#include <stdio.h>
// Άσκηση 1
void printRow(int n){
    // Εκτύπωσε τη n-οστή γραμμή
    /* Επειδή οι αριθμοί εκτυπώνονται σε 10 στήλες,
    αυτό σημαίνει ότι οι αριθμοί της γραμμής n έχουν n μονάδες*/
    for (int i = 0; i < 10; i++)
        printf("%d\t", 10*i + n);
        // κάθε στήλη χωρίζεται από έναν στηλοθέτη

    return;
}

int main() {
    // για 10 γραμμές
    for (int n = 1; n <= 10; n += 1) {
        printRow(n); // εκτύπωσε τη γραμμή που τελειώνει σε n
        printf("\n"); // πήγαινε στην επόμενη γραμμή
    }
    return 0;
}
